Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: ཆོས་ཐམས་ཅད་ནི་བདག་པོ་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་ཡོངས་སུ་བཟུང་བ་ལ་བརྩོན་ནོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since phenomena cannot be owned and yet sentient beings pursue ownership.

source: ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་དངོས་པོ་ལ་རྟེན་ཏོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are devoid of substantiality and yet sentient beings think they are supported by substantiality.

source: ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་ན་སེམས་ཅན་རྣམས་ནི་སྐྱེ་བ་ལ་རྟེན་ཏོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are devoid of arising and yet sentient beings believe they are subject to arising.

source: ཆོས་ཐམས་ཅད་ནི་མ་འཕོས་མ་བྱུང་བ་ན་སེམས་ཅན་རྣམས་ནི་འཆི་འཕོ་དང་སྐྱེ་བ་ལ་རྟེན་ཏོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are devoid of transference and emergence and yet sentient beings think they are subject to death and birth.

source: ཆོས་ཐམས་ཅད་ནི་ཀུན་ནས་ཉོན་མ་མོངས་པ་ན་སེམས་ཅན་རྣམས་ནི་ཀུན་ནས་ཉོན་མོངས་སོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are free of affliction and yet sentient beings are afflicted.

source: ཆོས་ཐམས་ཅད་ནི་འདོད་ཆགས་དང་བྲལ་བ་ན་སེམས་ཅན་རྣམས་ནི་འདོད་ཆགས་པར་བྱེད་དོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are free of desire and yet sentient beings give rise to desire.

source: ཆོས་ཐམས་ཅད་ནི་ཞེ་སྡང་དང་བྲལ་བ་ན་སེམས་ཅན་རྣམས་ཞེ་སྡང་བར་བྱེད་དོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are free of anger and yet sentient beings give rise to anger.

source: ཆོས་ཐམས་ཅད་ནི་གཏི་མུག་དང་བྲལ་བ་ན་སེམས་ཅན་རྣམས་ནི་གཏི་མུག་པར་གྱུར་ཏོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are free of bewilderment and yet sentient beings are bewildered.

source: ཆོས་ཐམས་ཅད་ནི་འོང་བ་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་འོང་བ་ལ་གནས་པའོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are free of coming and yet sentient beings experience coming.

source: ཆོས་ཐམས་ཅད་ནི་འགྲོ་བ་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་འགྲོ་བ་ལ་གནས་སོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are free of going and yet sentient beings experience going.

source: ཆོས་ཐམས་ཅད་ནི་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་མངོན་པར་འདུ་བྱེད་པ་ལ་སྤྱོད་དོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are devoid of formation and yet sentient beings experience formation.

source: ཆོས་ཐམས་ཅད་ནི་སྤྲོས་པ་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་སྤྲོས་པ་ལ་དགའོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are devoid of mental constructs and yet sentient beings are fond of mental constructs.

source: ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་ན་སེམས་ཅན་རྣམས་ནི་ལྟ་བ་ལ་ཞེན་ཏོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are empty and yet sentient beings are attached to views.

source: ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་མཚན་མའི་སྤྱོད་ཡུལ་ཅན་ནོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are without marks and yet sentient beings experience marks.

source: ཆོས་ཐམས་ཅད་ནི་སྨོན་པ་མེད་པ་ན་སེམས་ཅན་རྣམས་ནི་སྨོན་ལམ་ལ་སྤྱོད་དོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “The thus-gone ones feel great compassion for sentient beings since all phenomena are beyond wishes and yet sentient beings make aspirations.

source: ཀྱེ་མ་འཇིག་རྟེན་གནས་པ་འདི་ནི་ཕན་ཚུན་རྩོད་པས་ཡོངས་སུ་ཟིན་ཅིང་གནོད་སེམས་ཀྱི་ཐ་བའི་སྐྱོན་ལ་ཞུགས་པར་གཟིགས་ནས།
en: “Alas! Those who inhabit the worlds are caught up in disputes and flawed by hardened ill will.

source: དེ་དག་ལ་གནོད་སེམས་ཀྱི་ཐ་བའི་སྐྱོན་སྤོང་བའི་ཕྱིར་ཆོས་བསྟན་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་
en: the thus-gone ones wish to teach them the Dharma so that they may relinquish all the flaws of hardened ill will.

source: དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: Thus arises the thus-gone ones’ great compassion for sentient beings.

source: ཀྱེ་མ་འཇིག་རྟེན་གནས་པ་འདི་ནི་ཕྱིན་ཅི་ལོག་དང་ལྡན་ཞིང་ལམ་ཉམ་ང་བར་ཞུགས་པ་ལམ་གོལ་བ་ལ་གནས་པ་ཡིན་གྱིས།
en: “Alas! Those who inhabit the worlds are in error and enter dreadful, mistaken paths.

source: ཀྱེ་མ་འཇིག་རྟེན་གནས་པ་འདི་ནི་བརྐམ་ཞིང་འདོད་པའི་ཟིལ་གྱིས་ནོན་པ་སྟེ།
en: “Alas! Those who inhabit the worlds suffer from craving and are oppressed by their wants.

source: ཆོག་མི་ཤེས་ཤིང་གཞན་གྱི་ནོར་ལ་འཕྲོག་པ་ཡིན་གྱིས་
en: They know no contentment and rob others of their wealth.

source: དེ་དག་འཕགས་པའི་ནོར་དད་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། གཏོང་བ་དང་། ཤེས་རབ་དང་། ངོ་ཚ་ཤེས་པ་དང་ཁྲེལ་ཡོད་པའི་ནོར་ལ་དགོད་དོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: Seeing such beings, the thus-gone ones wish to establish them in the wealth of the noble ones: faith, discipline, learning, generosity, insight, integrity, and modesty. Thus arises their great compassion for sentient beings.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་བུ་སྨད་དང་། ཁྱིམ་དང་། ནོར་དང་། འབྲུ་ལ་སྲེད་པས་འཁོལ་བ་སྟེ། སྙིང་པོ་མེད་པ་ལ་སྙིང་པོར་འདུ་ཤེས་པ་ཡིན་གྱིས་
en: “Alas! Sentient beings are enslaved by attachments to family, home, wealth, and crops, perceiving a meaning where there is none.

source: དེ་དག་ལ་ཤིན་ཏུ་མི་རྟག་པར་བསྟན་པར་བྱའོ་ཞེས་དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: Seeing this, the thus-gone ones wish to show them the extreme impermanence of things. Thus arises their great compassion for sentient beings.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་མི་རིགས་པས་འཚོ་བ་སྟེ།
en: “Alas! For the sake of a livelihood sentient beings act in unreasonable ways, deceiving one another.

source: གཅིག་ལ་གཅིག་འདྲིད་པར་གནས་པ་ཡིན་གྱིས་དེ་དག་ལ་འཚོ་བ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ་
en: Seeing this, the thus-gone ones wish to teach them the Dharma so that their livelihood may become pure.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ཆོག་མི་ཤེས་པ་སྟེ། རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ལ་སྤྱོད་ཀྱང་བདག་ཅག་ནི་ཆོག་ཤེས་པའོ་སྙམ་དུ་འཛིན་གྱིས།
en: “Alas! Sentient beings are never content. No matter how much wealth, respect, or praise they receive, they never feel that it is enough.

source: དེ་དག་ལ་གང་འདི་སྡུག་བསྔལ་ཤིན་ཏུ་ཞི་ཞིང་བདེ་བའི་མྱ་ངན་ལས་འདས་པས་ཤིན་ཏུ་ཆོག་པར་བྱའོ་ཞེས་
en: Seeing such beings, the thus-gone ones wish to completely pacify their pain and fully satisfy them with the blissful transcendence of suffering.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ཁྱིམ་གྱི་གནས་སྡུག་བསྔལ་གྱི་སྣོད་ཤིན་ཏུ་ཉོན་མོངས་པ་ལ་རྟག་ཏུ་དགའ་བ་ཡིན་གྱིས་དེ་དག་ལས་བྱུང་ཞིང་ཁམས་གསུམ་པ་ལས་ཡང་དག་པར་འདའ་བར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ་ཞེས་
en: “Alas! Sentient beings are constantly obsessed with their homes, although they are containers of suffering and intense afflictions. Seeing such beings, the thus-gone ones wish to teach them the Dharma so that they may emerge from their homes and truly go beyond the three realms.

source: ཆོས་ཐམས་ཅད་ནི་རྒྱུས་ཉེ་བར་འགྲོ་བ་སྟེ། བསྒྲུབས་པས་ཉེ་བར་གནས་པའི་མཚན་ཉིད་ཡིན་ན། དེ་ལ་སེམས་ཅན་རྣམས་ནི་འཕགས་པའི་རྣམ་པར་གྲོལ་བ་ལ་ལེ་ལོ་བྱེད་ཀྱིས་
en: “All phenomena follow their causes and appear whenever those causes manifest. Yet sentient beings are lazy with respect to the noble ones’ liberation.

source: དེ་དག་ལ་རྣམ་པར་གྲོལ་བ་ལྷུར་བླང་བའི་ཕྱིར་བརྩོན་འགྲུས་བརྩམ་པར་ཆོས་བསྟན་ཏོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: Seeing such beings, the thus-gone ones wish to teach them the Dharma so that they can muster diligence and pursue liberation. Thus arises the thus-gone ones’ great compassion for sentient beings.

source: སེམས་ཅན་རྣམས་ནི་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་དམ་པ་ཁྱད་པར་དུ་འཕགས་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་འདི་བཏང་ཞིང་
en: “Sentient beings relinquish the exalted complete transcendence of suffering, which is distinguished by the sacred wisdom of nonattachment.

source: གང་འདི་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དམན་པ་ཚོལ་བ་ཡིན་གྱིས་དེ་དག་ལ་གང་འདི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་དམིགས་པར་བྱ་བའི་ཕྱིར་རྒྱ་ཆེན་པོ་ལ་བློ་མོས་པར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེ་སྟེ།
en: Instead, they search for the inferior vehicles of the hearers and solitary buddhas. Seeing such beings, the thus-gone ones wish to inspire them toward the vast, so that they may come to focus on the wisdom of the buddhas. Thus arises the thus-gone ones’ great compassion for sentient beings.

source: རིགས་ཀྱི་བུ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་དང་ལྡན་ན་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ།
en: “Noble son, whenever these thirty-two features are present, that is the arising of the thus-gone ones’ great compassion for sentient beings.

source: དེ་བས་ན་དེ་བཞིན་གཤེགས་པ་ཐུགས་རྗེ་ཆེན་པོ་ལ་གནས་པ་ཞེས་བྱ་སྟེ།
en: “Noble son, in this way the thus-gone ones are said to abide in great compassion.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་སེམས་ཅན་དག་ལ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་དང་ལྡན་པའི་སྙིང་རྗེ་ཆེན་པོ་སྐྱེ་ན་
en: Noble son, know that whenever such great compassion for sentient beings endowed with these thirty-two features arises in a bodhisattva,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བསོད་ནམས་ཀྱི་ཞིང་གཟི་བརྗིད་ཆེན་པོས་རྒྱས་པ་ཕྱིར་མི་ལྡོག་པ་སེམས་ཅན་གྱི་དོན་ལ་བརྩོན་པར་རིག་པར་བྱའོ།
en: that bodhisattva great being will have become a splendorous and vast field of merit and become irreversible in the diligent pursuit of sentient beings’ welfare.”

source: སྙིང་རྗེ་ཆེན་པོའི་ཆོས་ཀྱི་སྒོའི་ལེའུ་འདི་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པ་ན་
en: When the Blessed One taught this section on the Dharma gateways to great compassion,

source: སྲོག་ཆགས་སྟོང་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: thirty-two thousand beings set their minds on unsurpassable and perfect awakening,

source: སྲོག་ཆགས་བརྒྱ་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ།
en: one hundred thousand beings gained acceptance that phenomena are nonarising,

source: ལྷའི་བུ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: seventy-two thousand gods gained the immaculate and stainless Dharma eye with regard to phenomena.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་དག་ལ་སོགས་པ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབང་སྒྱུར་གྱི་ཆོས་ཀྱི་རྣམ་པར་འགོད་པ་ནི་དཔག་ཏུ་མེད་གྲངས་མེད་དེ།
en: “Noble son, in this way the arrays of masterful qualities achieved by the thus-gone ones and bodhisattvas are unfathomable and beyond count.

source: དེ་དག་ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པར་དེ་བཞིན་གཤེགས་པས་བསྟན་ཀྱང་མཐའ་མེད་ན་
en: The thus-gone ones may teach on this topic until the end of time and yet these qualities would remain infinite.

source: སེམས་ཅན་རྣམས་ཀྱི་དགའ་བ་དང་། དད་པ་དང་། རངས་པ་བསྐྱེད་པའི་ཕྱིར་ཕྱོགས་ཙམ་ཞིག་བསྟན་ཏེ།
en: Here I have merely touched upon them so that sentient beings may be joyous, faithful, and delighted.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་དཀར་པོ་ལས་འཐུན་པར་འབྱུང་བའི་དབུགས་འབྱུང་བ་དང་། རྔུབ་པའི་སྲོག་ཉེ་བར་སྦྱོར་བ་ལ་མཁས་པ་ཡིན་ནོ།
en: Thus bodhisattvas are masters of using every exhalation and inhalation in virtuous ways for the benefit of sentient beings.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་ཆར་སྤྲིན་དཔག་ཏུ་མེད་པ་ཀུན་འཛིན་ནུས་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, are bodhisattvas capable of containing the limitless rainclouds of Dharma?

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རླུང་མར་ནི་རླུང་གི་དཀྱིལ་འཁོར་མུ་མེད་ཅིང་
en: Noble son, think of the infinite circle of wind.

source: རྒྱ་ཆེ་ལ་བརྟན་ཞིང་སྲ་བས་འཇིག་རྟེན་གྱི་ཁམས་འཇིག་པ་དང་འབྱུང་བ་
en: Vast, stable, and strong, it causes the destruction and emergence of the world

source: ཆར་སྤྲིན་དང་བཅས་པ། རྒྱ་མཚོ་དང་། གླིང་ཆེན་པོ་བཞི་པར་བཅས་པ། རི་རབ་དང་། རི་བཏང་བཟུང་དང་། རི་བཏང་བཟུང་ཆེན་པོ་དང་། གངས་དང་། ཁོར་ཡུག་རི་དང་། ཁོར་ཡུག་རི་ཆེན་པོ་དང་། རི་སྤོས་ཀྱི་ངད་ལྡང་བ་དང་། གྲོང་རྡལ་དང་། འབབ་ཆུ་དང་། ནགས་ཚལ་དང་། གཞལ་མེད་ཁང་གི་རྣམ་པར་བཅས་པ་དག་ཡོངས་སུ་འཛིན་ཏོ།
en: contains the rainclouds, oceans, four great continents, Mount Sumeru, Mucilinda Mountains, Mahā­muci­linda Mountains, snow mountains, circular mountains, great circular mountains, gandha­mādana Mountains, and all towns, streams, forests, and palaces.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་གཟུངས་ཀྱི་རླུང་མར་གྱི་དཀྱིལ་འཁོར་མུ་མེད་པས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་སྤྲིན་གྱིས་ཕབ་པའི་གཏན་པ་མེད་པའི་ཆོས་ཀྱི་ཆར་གྱི་རྒྱུན་ཆེན་པོ་ཐམས་ཅད་ཡོངས་སུ་འཛིན་ཏོ།
en: Similarly, bodhisattva great beings employ the infinite wind circle of the retentions to contain the boundless and continuous Dharma rain that falls from the clouds of the perfect buddhas.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་འབྱུང་བའི་ཚེ་ཇི་སྐད་དུ་བརྗོད་པའི་རི་རབ་དང་། རྒྱ་མཚོ་དང་། གླིང་ཆེན་པོ་བཞི་པ་དང་། རི་བཏང་བཟུང་དང་། རི་བཏང་བཟུང་ཆེན་པོ་དང་། གངས་དང་། ཁོར་ཡུག་རི་དང་། ཁོར་ཡུག་རི་ཆེན་པོ་དང་། རི་སྤོས་ཀྱི་ངད་ལྡང་བ་དང་། གྲོང་རྡལ་དང་། འབབ་ཆུ་དང་། ནགས་ཚལ་དང་། གཞལ་མེད་ཁང་གི་རྣམ་པ་ལྟ་བུ་
en: Thus, similar to how the realms of the world emerge with Mount Sumeru, the oceans, the four great continents, the Mucilinda Mountains, the Mahā­muci­linda Mountains, the snow mountains, the circular mountains, the great circular mountains, the gandha­mādana Mountains, and the towns, streams, forests, and palaces,

source: བསོད་ནམས་བརྒྱ་པའི་མཚན་དང་། ས་དང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། མངོན་པར་ཤེས་པ་དང་། དབང་དང་། སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། མ་འདྲེས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་སོགས་པ་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཡོངས་སུ་འཛིན་ཏོ།
en: bodhisattvas embody the hundredfold meritorious marks, the grounds, the perfections, the absorptions, the retentions, the superknowledges, the masteries, the powers, the fearlessnesses, the correct understandings, the unique qualities, the great compassion, and all other such perfect qualities of the buddhas and bodhisattvas.

source: འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱ་སྟོང་མུ་མེད་པ་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཀྱང་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་ཡོངས་སུ་འཛིན་ཏེ།
en: Indeed, they constantly and continuously embody an infinite number of hundreds of thousands of heaps of mundane and supramundane qualities.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་ཆར་སྤྲིན་དཔག་ཏུ་མེད་པ་ཀུན་འཛིན་ནུས་པ་ཡིན་ནོ།
en: Thus, bodhisattvas are capable of containing the limitless rainclouds of Dharma.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རྣམ་པ་ཐ་དད་པའི་གཞལ་མེད་ཁང་ཆེན་པོའི་བཀོད་པ་རྣམ་པར་དབྱེ་བ་ཐམས་ཅད་རྣམ་པར་འབྱེད་ཅིང་ཡོངས་སུ་འགོད་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, do bodhisattvas open up and arrange the infinite structures of great palaces of distinct Dharma teachings?

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རླུང་མར་ནི་གཞལ་མེད་ཁང་དགོད་པའི་རྣམ་པར་དབྱེ་བ་སྣ་ཚོགས་ཐམས་ཅད་ཀུན་ནས་གཞོག་པར་བྱེད།
en: Consider, noble son, the analogy of how the wind enters and separates the structures of a palace.

source: རྣམ་པར་འབྱེད་པར་བྱེད་དེ། ནགས་ཚལ་དང་། ཤིང་དང་། ཡལ་ག་དང་། འདབ་མ་དང་། ལྡུམ་བུ་དང་། མྱུ་གུ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། ལོ་མ་དང་། སྡོང་པོ་ལ་སོགས་པ་དང་།
en: The wind also constantly and continuously enters, moves between, and uplifts the forests, trees, branches, petals, stalks, sprouts, flowers, fruits, leaves, trunks, and so on,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡན་ལག་དང་། ཉིང་ལག་རྣམ་པར་དབྱེ་བ་
en: just as it does with the various limbs and body parts of sentient beings.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རླུང་མར་ཡང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པའི་ཡེ་ཤེས་མ་ཐོགས་མ་ཆགས་ཤིང་
en: Similarly, in numerous ways, the wind-like bodhisattvas employ their unhindered and unobstructed wisdom with respect to correct understandings and eloquence

source: མཐའ་ཡས་པས་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་སྒོ་སྣ་ཚོགས་ནས་ཡོངས་སུ་གཞོག་པར་བྱེད།
en: to move between, distinguish, illumine, reveal, and bring to attainment all mundane and supramundane perfections.

source: རྣམ་པར་འབྱེད་པར་བྱེད། སྣང་བར་བྱེད། ཡོངས་སུ་སྟོན་པར་བྱེད། ཐོབ་པར་བྱེད་ཅིང་རྣམ་པ་འདི་དག་འདི་ལྟ་སྟེ། ཆོས་འདི་དག་ནི་ངན་སོང་སྒྲུབ་པའོ། །འདི་དག་ནི་བདེ་འགྲོ་སྒྲུབ་པའོ།
en: Thus they discern the various teachings, and show which ones cause the lower realms and which ones lead to the higher realms.

source: འདི་དག་ནི་བདག་པོར་སྒྲུབ་པའོ། །འདི་དག་ནི་སེམས་ཅན་དམྱལ་བ་སྒྲུབ་པའོ། །འདི་དག་ནི་བྱོལ་སོང་གི་སྐྱེ་གནས་སྒྲུབ་པའོ། །འདི་དག་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་སྒྲུབ་པའོ། །འདི་དག་ནི་མིར་སྒྲུབ་པའོ། །འདི་དག་ནི་ལྷར་སྒྲུབ་པའོ། །འདི་དག་ནི་འཁོར་ལོས་སྒྱུར་བར་སྒྲུབ་པའོ།
en: They determine which ones produce mastery, or an existence in hell, or as an animal, or in the realm of the Lord of Death, or as a human, or as a god, or as a universal emperor.

source: དེ་བཞིན་དུ་མདོར་བསྡུས་ཏེ། འདི་དག་ནི་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་སྒྲུབ་པའོ། །འདི་དག་ནི་གཟུགས་དང་། གཡོག་དང་། ཡིད་གཞུངས་པ་དང་། དཔལ་ཆེན་པོ་སྒྲུབ་པའོ།
en: “Similarly, concisely, they declare which teachings produce Śakra, Brahmā, and the guardians of the world, just as they show which ones lead to discord, servitude, clear-mindedness, or great glory.

source: འདི་དག་ནི་རིག་པའོ། །འདི་དག་ནི་སྒྱུ་རྩལ་ཏོ། །འདི་དག་ནི་བཟོའི་གནས་སོ། །འདི་དག་ནི་གཙུག་ལག་སྣ་ཚོགས་ལ་རྣམ་པ་ཐམས་ཅད་དུ་མཁས་པའོ།
en: They determine which teachings concern science, arts, or crafts, and which ones convey universal expertise in manifold fields of knowledge.

source: འདི་དག་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་སྟེ། ཉན་ཐོས་སུ་འགྱུར་བའོ། །
en: They determine which teachings belong to the Vehicle of the Hearers and turn one into a hearer.

source: འདི་དག་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་སྟེ། རང་སངས་རྒྱས་སུ་འགྱུར་བའོ།
en: They point out which teachings belong to the Solitary Buddha Vehicle and turn one into a solitary buddha,

source: འདི་དག་ནི་ཐེག་པ་ཆེན་པོ་སྟེ། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་བདག་དང་། གཞན་གྱི་དོན་ཡང་དག་པར་འཐོབ་པར་བྱེད་པ་ཀུན་ཏུ་བཟང་པོ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བའོ། །
en: they show which teachings are of the Great Vehicle by virtue of possessing all supreme aspects, serving as the means for truly accomplishing the welfare of others, being ever excellent, and resulting in omniscience.

source: དེ་བཞིན་དུ་མདོར་བསྡུས་ཏེ། འདི་དག་ནི་ས་རྣམས་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། རིག་པ་རྣམས་དང་། དབང་རྣམས་དང་། གཟུངས་རྣམས་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། མ་འདྲེས་པ་རྣམས་སོ་ཞེས་
en: Likewise, concisely, they declare which teachings pertain to the grounds, transcendences, absorptions, knowledges, masteries, retentions, superknowledges, liberations, powers, fearlessnesses, correct understandings, and the unique qualities.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་དག་ལ་སོགས་པ་རྣམ་པ་ཚད་མེད་པས་གཟུངས་པད་མ་བཀོད་པ་ལ་སོགས་པ་ལ་མཁས་པས། ཆོས་བཀོད་པ་རྣམ་པར་བཀོད་པ་དག་བྱེད་དེ།
en: Noble son, in infinite ways such as these, the bodhisattvas employ their expertise in retentions, such as that of the lotus array, to arrange the displays of the Dharma.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རྣམ་པ་ཐ་དད་པའི་གཞལ་མེད་ཁང་ཆེན་པོའི་བཀོད་པ་རྣམ་པར་དབྱེ་བ་ཐམས་ཅད་རྣམ་པར་འབྱེད་ཅིང་ཡོངས་སུ་དགོད་པ་ཡིན་ནོ།
en: Thus, bodhisattvas differentiate and arrange the infinite displays of great palaces of distinct Dharma teachings.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་གྱི་དཀྱིལ་འཁོར་དཔག་བསམ་གྱི་ཤིང་ལས་ཤིན་ཏུ་བྱུང་བའི་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་གདོན་མི་ཟ་བའི་མེ་ཏོག་ཡིད་དུ་འོང་བའི་ཆར་རྟག་ཏུ་མངོན་པར་འབེབས་པ་ཡིན་ཞེ་ན།
en: “In what way, you may wonder, do bodhisattvas bring down a continuous and delightful flower rain of the true and indisputable Dharma from wish-fulfilling trees upon the circles of disciples?

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རླུང་མར་ནི་དཔག་བསམ་གྱི་ཤིང་གི་ནགས་ཚལ་
en: Consider, noble son, the wind that blows through a forest of wish-fulfilling trees.

source: དག་ལས་གང་གིས་ལྷ་དང་། མི་རྣམས་ཤིན་ཏུ་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་མྱ་ངན་མེད་པར་རྣམ་པར་རྩེ་བ་དང་། ཉམས་བདེ་ཞིང་ཡོངས་སུ་སྤྱོད་དེ།
en: brings utter joy to gods and humans. With happy minds they are free of suffering and feel loving and blissful.

source: རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་ཁ་དོག་དང་། སྟོབས་དང་། མཐུ་དང་། ཡིད་བདེ་བ་ལས་ཡོངས་སུ་མི་ཉམས་པ་དེ་ལྟ་བུའི་སྤོས་དང་། མེ་ཏོག་དང་། རྒྱན་དང་། གོས་དང་། རྔ་དང་། སིལ་སྙན་ལ་སོགས་པ་ཕུན་སུམ་ཚོགས་པའི་ཆར་མངོན་པར་འབེབས། ཡོངས་སུ་སྐྱོད་ཅིང་འབྱིན་པར་བྱེད་དོ།
en: causes their complexion, power, abilities, and happiness of mind to never decrease while it showers them with a rain of delightful incense, flowers, ornaments, garments, drums, cymbals, and so forth.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རླུང་མར་ཡང་ཡོངས་སུ་དག་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ནས་
en: “Similarly, coming from the thus-gone ones and their bodhisattva retinues who reside in the pure realms, the wind-like bodhisattvas

source: སེམས་ཅན་དེ་དག་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་ཆོས་ཀྱི་དགའ་བ་ལ་མོས་ཤིང་འདུན་པ་དང་།
en: constantly and continuously inspire and motivate sentient beings to engage with the joy of the Dharma.

source: ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་།
en: Thus, they bring them freedom from evil acts of body, speech, and mind;

source: གཟི་དང་ལྡན་པ་དང་། ཡོངས་སུ་སྐྱོ་བར་མི་འགྱུར་བ་དང་།
en: splendor and freedom from weariness;

source: ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཉམས་སུ་མྱོང་བར་བྱེད་པ་དང་།
en: and the experience of all divine and human perfections.

source: མི་ཉམས་པའི་ཆོས་ཅན་དུ་འགྱུར་བ་དང་། ཤེས་རབ་ཀྱིས་སྣང་བར་གྱུར་པས་
en: Saving them from all degeneration, and shining with the light of insight,

source: རྟག་ཏུ་ཁྱད་པར་གྱི་རྣམ་པར་འདོད་པར་འགྱུར་བའི་མདོ་དང་། དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། རྟོགས་པ་བརྗོད་པ་དང་། འདི་ལྟ་བུ་འདས་པ་དང་། སྐྱེས་པའི་རབས་དང་། ཤིན་ཏུ་རྒྱས་པ་དང་། ཆོས་རྨད་དུ་བྱུང་བ་དང་། གཏན་ལ་ཕབ་པར་བསྟན་པ་དག་དང་ལྡན་པའི་དམ་པའི་ཆོས་རིན་པོ་ཆེའི་མེ་ཏོག་ལ་སོགས་པའི་ཆར་མངོན་པར་འབེབས་སོ།
en: they scatter a rain of the flowers of precious Dharma in the form of requested discourses, proclamations in song, prophesies, teachings in verse, purposeful expressions, declarations, narratives, parables, accounts of former lives, extensive teachings, marvels, and established doctrines.

source: ལུགས་དང་འཐུན་པ་དང་། ལུགས་དང་མི་འཐུན་པ་དང་། སྣྲེལ་ཞི་དང་། སྤྱིའུ་ཚུགས་ཀྱི་རྒྱུད་ལ་སོགས་པའི་གཏམ་རྣམ་པར་གདོན་མི་ཟ་བ་ཉེ་བར་སྒྲུབ་བོ།
en: They set forth matters indubitably with accounts that are conventional, unconventional, oblique, inverted, and so forth.

source: ཐ་སྙད་ཀྱི་དམིགས་པ་ཐམས་ཅད་ལ་བདག་མེད་པ་ཞི་ཞིང་རྣམ་པར་དག་པའི་ཆོས་ཉིད་རྗོད་ཅིང་སྟོན་ལ་རྣམ་པར་བྱང་བར་བྱེད་དོ།
en: They purify sentient beings by showing that all conventional reference points are selfless and pacified, and by declaring and revealing the perfectly pure intrinsic nature.

source: ཆོས་ཐམས་ཅད་སྒོ་ཀུན་ཏུ་ཡང་དག་པར་གཞོལ་བ་ཡོངས་སུ་སྟོན་ཏོ།
en: They show them how to genuinely enter all gateways to the Dharma.

source: སྒྱུ་མའི་རྣམ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འཇུག་པ་ཉེ་བར་སྦྱོར་རོ།
en: They make others engage with inconceivable modes of illusion,

source: ཡེ་ཤེས་སྒྱུ་མ་རྣམ་པར་རྒྱས་པར་བྱེད་དེ། ཆོས་ཐམས་ཅད་ལ་དགའ་བར་རྩེ་བའི་རྣམ་པར་འཕྲུལ་པ་རྣམས་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་རྒྱས་པར་བྱེད་དོ།
en: unfold wisdom illusions, and project emanations that joyfully revel in all phenomena, thus ripening sentient beings.
